#### 📖 Terraform Plan ('infra/github-runner/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.container_app_job_selfhosted_runner.module.container_app_job_selfhosted_runner.azapi_resource.container_app_job must be replaced
-/+ resource "azapi_resource" "container_app_job" {
      ~ body                      = jsonencode(
          ~ {
              ~ properties = {
                  ~ environmentId = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-github-runner-rg-01/providers/Microsoft.App/managedEnvironments/io-p-itn-github-runner-cae-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-github-runner-rg/providers/Microsoft.App/managedEnvironments/io-p-github-runner-cae"
                    # (2 unchanged attributes hidden)
                }
            }
        )
      ~ id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-github-runner-rg-01/providers/Microsoft.App/jobs/io-p-wallet-ca-job" -> (known after apply)
      ~ location                  = "italynorth" -> "westeurope" # forces replacement
        name                      = "io-p-wallet-ca-job"
      ~ output                    = jsonencode({}) -> (known after apply)
      ~ parent_id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-github-runner-rg-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-github-runner-rg" # forces replacement
        tags                      = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/infra/github-runner/prod"
        }
        # (5 unchanged attributes hidden)

      ~ identity {
          ~ principal_id = "14dd885a-260d-4e62-9de8-33c09ee20297" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.container_app_job_selfhosted_runner.module.container_app_job_selfhosted_runner.azurerm_key_vault_access_policy.keyvault_containerapp must be replaced
-/+ resource "azurerm_key_vault_access_policy" "keyvault_containerapp" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common/objectId/14dd885a-260d-4e62-9de8-33c09ee20297" -> (known after apply)
      - key_permissions         = [] -> null
      ~ object_id               = "14dd885a-260d-4e62-9de8-33c09ee20297" # forces replacement -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
      ~ tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ container_app_job = {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-github-runner-rg-01/providers/Microsoft.App/jobs/io-p-wallet-ca-job" -> (known after apply)
        name                = "io-p-wallet-ca-job"
      ~ resource_group_name = "io-p-itn-github-runner-rg-01" -> "io-p-github-runner-rg"
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
